level-07/app/controllers/departments_controller.rb

INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "CSE"], ["created_at", "2019-10-26 10:37:50.871407"], ["updated_at", "2019-10-26 10:37:50.871407"]]
---
  def create
    @department = Department.new(department_params)
    if @department.save