level-07/app/controllers/students_controller.rb

	def index
	    if params[:department_id]&&params[:section_id]
	      @students = Student.where({department_id: params[:department_id],section_id: params[:section_id]}).all
	    elsif params[:department_id]
			@students = Student.where(department_id: params[:department_id]).all
	    elsif params[:section_id]
			@students = Student.where(section_id: params[:section_id]).all
	    else
	      @students = Student.all
---
SELECT "students".* FROM "students" WHERE "students"."section_id" = ?  [["section_id", 1]]
SELECT "students".* FROM "students"

	  def new
	    @student = Student.new
	    @section_collection = Section.all.collect { |p| [p.name, p.id]}
	    @department_collection = Department.all.collect { |p| [p.name, p.id] }
---
SELECT "sections".* FROM "sections"
SELECT "departments".* FROM "departments"

	  def create
	    @student = Student.new(student_params)
	    if @student.save
---
INSERT INTO "students" ("name", "department_id", "section_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ram"], ["department_id", 1], ["section_id", 1], ["created_at", "2019-10-26 14:18:51.108231"], ["updated_at", "2019-10-26 14:18:51.108231"]]

	  def show
	    @students = Student.find(params[:id])
	    @sections = Section.find(@students.section_id)
	    @departments = Department.find(@students.department_id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]