level-08/app/models/student.rb

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
 	def validate_section_mapping
    		section = Section.find_by_id(section_id)

SELECT COUNT(*) FROM "students"
---
	def generate_roll_no
    		max_count = Student.count